In [1]:
import pandas as pd
import numpy as np

In [2]:
flight = pd.DataFrame({'From_to':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
             'FlightNumber':[10045, np.nan, 10065, np.nan, 10085],
             'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
             'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})
flight

            From_to  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
flight['FlightNumber'].fillna(value = flight['FlightNumber'][0]+10,limit=1,inplace = True)

In [4]:
flight['FlightNumber'].fillna(value = flight['FlightNumber'][2]+10,limit=1,inplace = True)

In [5]:
flight['FlightNumber'] = flight['FlightNumber'].astype(np.int64)

In [6]:
flight

            From_to  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [7]:
print(type(flight['From_to'].str.split('_',1)))
th = flight['From_to'].str.split('_',1)
th

<class 'pandas.core.series.Series'>

0        [LoNDon, paris]
1        [MAdrid, miLAN]
2    [londON, StockhOlm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: From_to, dtype: object

In [8]:
print(type(flight['From_to'].str.split('_',1).to_list()))
ht = flight['From_to'].str.split('_',1).to_list()
ht

<class 'list'>

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [9]:
temp_data = pd.DataFrame(flight['From_to'].str.split('_',1).to_list(),columns=['From','To'])

In [10]:
temp_data

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [11]:
temp_data['From']= temp_data['From'].str.capitalize()
temp_data

       From         To
0    London      paris
1    Madrid      miLAN
2    London  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [12]:
pd.concat([temp_data,flight],axis=1)

,From,To,From_to,FlightNumber,RecentDelays,Airline
0,London,paris,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,Madrid,miLAN,MAdrid_miLAN,10055,[],<Air France> (12)
2,London,StockhOlm,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest,PaRis,Budapest_PaRis,10075,[13],12. Air France
4,Brussels,londOn,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

In [13]:
flight = pd.concat([flight,temp_data],axis=1,sort=True)

In [14]:
flight

,From_to,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [15]:
flight['RecentDelays'].to_list()

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [16]:
delays = pd.DataFrame(flight['RecentDelays'].to_list(),columns=['delay_1','delay_2','delay_3'])
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [17]:
pd.concat([flight,delays],axis=1)

,From_to,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,paris,23.0,47.0,NaN
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,miLAN,NaN,NaN,NaN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,StockhOlm,24.0,43.0,87.0
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis,13.0,NaN,NaN
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn,67.0,32.0,NaN

In [19]:
flight.drop(columns= ['RecentDelays'],inplace=True)

In [21]:
flight.drop(columns = ['From_to'],inplace = True)

In [22]:
flight

   FlightNumber              Airline      From         To
0         10045               KLM(!)    London      paris
1         10055    <Air France> (12)    Madrid      miLAN
2         10065  (British Airways. )    London  StockhOlm
3         10075       12. Air France  Budapest      PaRis
4         10085          "Swiss Air"  Brussels     londOn

In [24]:
flight.insert(loc=3, column='delay_1',value=delays['delay_1'])

ValueError: cannot insert delay_1, already exists

In [27]:
flight.insert(loc=4, column='delay_2',value=delays['delay_2'])

In [30]:
flight.insert(loc=5, column='delay_3',value=delays['delay_3'])

ValueError: cannot insert delay_3, already exists

In [29]:
flight

,FlightNumber,Airline,From,delay_1,delay_3,delay_2,To
0,10045,KLM(!),London,23.0,NaN,47.0,paris
1,10055,<Air France> (12),Madrid,NaN,NaN,NaN,miLAN
2,10065,(British Airways. ),London,24.0,87.0,43.0,StockhOlm
3,10075,12. Air France,Budapest,13.0,NaN,NaN,PaRis
4,10085,"""Swiss Air""",Brussels,67.0,NaN,32.0,londOn